<template>
  <section id="section:web-accessibility">
    <h2>webアクセシビリティとは何か</h2>
    <p>おそらくこのセッションに聞きに来ていただいた方は、webアクセシビリティになんらかの興味をもっていたり、実際に業務に取り組んでいたり取り組もうとしている方が大半かもしれませんので、webアクセシビリティについて説明しなくてもいいかと資料を作っているときに思っていました。</p>
    <p>ですがそうした方たち以外も、アクセシビリティについてわからないが気になってる方や、なんとなく聞きに来た方もいるかもしれません。もしかしたらこのセッションが後日公開されたときにふとクリックして見に来ることもあるかもしれませんので、最初にwebアクセシビリティとはいったい何なのかを説明したいと思います。</p>
    <h3>webアクセシビリティの定義</h3>
    <p>まずAccessibilityとは「アクセスできる・アクセスしやすさ」と翻訳されます。webアクセシビリティはweb上にある情報やコンテンツに、あらゆる人がアクセスできようにすることを指します。</p>
    <p>あらゆる人がアクセスできるようにするとはどういうことかというと、デバイス操作に慣れない人でも簡単に閲覧できるようにしたり、難しい言い回しを避けて理解しやすくしたり、コントラストを調整して閲覧しやすいデザインにしたり、音声読み上げをしてくれるスクリーンリーダーといった支援技術を使うために考慮するといったことです。</p>
    <blockquote>
      <p>世界には10億人、言い換えると、人口の15から20％の割合で障害を持つ人がいます。国連は障害者の権利条約を定めており、人権としてウェブを含んだ情報へのアクセスはほとんどの国で国連条約として批准されています。また数カ国では政策として義務付けられています。法律や規制にも関わらずアクセシビリティ標準を実行するのは、障害を持つ人たちにも、全ての人達にも不可欠なことです。</p>
      <a
        href="https://www.w3.org/WAI/videos/standards-and-benefits/ja"
        target="_blank"
        rel="noopener"
      >W3Cのアクセシビリティと標準技術 | Web Accessibility Initiative (WAI) | W3C</a>
    </blockquote>
    <h3>日本における障害者の割合</h3>
    <ul>
      <li>身体障害者 436万人</li>
      <li>知的障害者 108万２千人</li>
      <li>精神障害者 392万３千人</li>
    </ul>
    <blockquote>
      <p>これを人口千人当たりの人数でみると、身体障害者は34人、知的障害者は９人、精神障害者は33人となる。複数の障害を併せ持つ者もいるため、単純な合計にはならないものの、国民のおよそ7.6％が何らかの障害を有していることになる。</p>
      <a
        href="https://www8.cao.go.jp/shougai/whitepaper/r01hakusho/zenbun/siryo_02.html"
        target="_blank"
        rel="noopener"
      >参考資料 障害者の状況｜令和元年版障害者白書（全体版） - 内閣府</a>
    </blockquote>
    <h3>アクセシビリティ対応とは障害者対応なのか</h3>
    <p>よくある誤解なのですが、アクセシビリティ対応をすることは障害者対応だと捉えられていることがあります。</p>
    <p>たしかにアクセシビリティ対応は障害者が使えるようにする目的もあるのですが、それ自体が目的なのではなく「あらゆる人が使えるようにする」ことが目的なので、障害者対応だけが先鋭化されて誤解につながっているように思います。</p>
    <p>Google I/Oでは音声認識においてリアルタイムで字幕がつけられるライブキャプション機能がつけられました。聴覚障害の方はもちろん、ミュートにした状態でビデオを見たり、文章を書き起こして内容の理解につなげたりなど、あらゆる状況においてどんな人でも使えるようなものを生み出しています。</p>
    <figure>
      <img
        src="https://o.aolcdn.com/dims-global/dims3/GLOB/resize/1200x577/quality/80/https://techcrunch.com/wp-content/uploads/2019/05/live-caption.jpg"
        height="480"
        alt="Live Caption機能の紹介サムネイル"
      />
      <figcaption>
        <a
          href="https://jp.techcrunch.com/2019/05/08/2019-05-07-live-transcription-and-captioning-in-android-are-a-boon-to-the-hearing-impaired/"
        >Google I/Oはアクセシビリティ強化に全力、聴覚障害者にも電車でYouTubeを見るにも便利</a>
      </figcaption>
    </figure>
    <p>スクリーンリーダーも視覚障害者のためだけではなく、読字障害といった長文を読むのが困難な人を手助けしたり、文章の確認を目視だけで行うよりも読み上げてもらうことで間違いに気づきやすくなります。</p>
    <h3>皆が参加できるためのアクセシビリティ対応</h3>
    <p>アクセシビリティは使いやすさを重視する「ユーザビリティ」と混同されがちですが、使いやすいかどうか以前に使えるかどうかを考えることが目的です。そして、使えるということは、参加できるかどうかということにも繋がります。</p>
    <p>海外では法律でアクセシビリティを確保する決まりを定めていますが、これはアクセシビリティを手段として考えているより、アクセシビリティ自体を人権として捉えている部分があるからです。</p>
  </section>
</template>
