<template>
  <section id="section:accessibility-relationship">
    <h2>アクセシビリティ対応と必要性について</h2>
    <p>Webアクセシビリティについて、Vue.js開発におけるアクセシビリティの関わり方についてを紹介しました。興味をもっていただいたところで、この節では様々なアクセシビリティ対応、そして何が必要となるかについてを紹介します。</p>
    <!--h3>カンファレンスとアクセシビリティ対応</h3>
    <p>次はカンファレンスの視点でのアクセシビリティの付き合い方についても考えてみましょう。</p>
    <h4>カンファレンスのアクセシビリティ方針</h4>
    <p>今年の11月30日から12月1日まで日本でも開催されたJSConfですが、これまでのイベントではアクセシビリティページが用意されています。</p>
    <figure>
      <img
        src="~/assets/img/vue-a11y-jsconfeu.png"
        height="336"
        alt="JSConf EU2019のアクセシビリティページのスクリーンショット"
      />
      <figcaption>
        <a
          href="https://2019.jsconf.eu/accessibility/"
          target="_blank"
          rel="noopener"
        >Accessibility - JSConf EU</a>
      </figcaption>
    </figure>
    <p>会場はバリアフリーな施設であるか、案内は看板など視覚的な誘導はあるか、発表でキャプション表示や手話対応はあるか、託児所のような子どもを預かれる場所はあるか等、考えればキリはないのですが、配慮がまったく無いことは何らかの障壁がある参加者を排除してしまっていることにも繋がってしまいます。</p>
    <p>9月に開催された技術書典7では車椅子・ベビーカーでの来場を可能にして、託児サービスもはじめていました。今後のカンファレンスや勉強会・イベントでも、こういった配慮が少しずつでもできるようになればいいなと思っております。</p>
    <a
      href="https://blog.techbookfest.org/2019/09/12/wchair-baby-car/"
      target="_blank"
      rel="noopener"
    >技術書典7へ車椅子・ベビーカー・お子様連れでご来場の皆さまへ - 技術書典ブログ</a>
    <h4>通訳・翻訳</h4>
    <p>海外ゲストのセッションがある際、これまでは英語のみでしたが、同時通訳されるカンファレンスも増えてきました。私自身英語の聞き取りには自信が無いのでこういった配慮は大変ありがたいです。</p>
    <p>では日本語で発表する内容は海外の方が聞くときに通訳されているでしょうか。日本でのカンファレンスなのだから必要はないと感じるかもしれませんが、日本語は分からないけどどういったセッションなのかを知りたい人はいるかもしれません。</p>
    <p>国際化といった翻訳や通訳は対応コストがかかるもので容易なことではありませんが、どこかが一方通行にならないように情報を提供する取り組みも必要だと感じています。</p-->
    <h3>日本とアクセシビリティ対応</h3>
    <p>この日本でのどのようなアクセシビリティが必要になってるかご存知でしょうか。</p>
    <h4>超高齢化社会</h4>
    <p>日本は世界トップクラスの長寿国である一方、人類がこれまで経験したことのない超高齢化社会にも突入しています。</p>
    <p>15歳以上65歳未満の生産年齢人口が今後減っていく中、誰もが参加することのできるアクセシビリティ対応をしていくことは、社会意義としても重要になってくることでしょう。</p>
    <h4>3.11以降の対応</h4>
    <p>2011年3月11日、東日本大震災という大きな災害が発生しました。あれから8年が経とうとしていますが、皆さんの記憶には鮮明に残っていることでしょう。</p>
    <p>震災発生以後、聴覚障害者のための対応が増えたということはあまり知られていないかもしれません。</p>
    <p>防災無線が聞こえなかったせいで聴覚障害者の死亡率が健常者と比較して2倍だったことや、避難生活ではコミュニケーションを取ることができず孤立化したり、障害者を支援する措置が不足していたりなど問題が浮き彫りとなっていたからです。</p>
    <figure>
      <div class="youtube-frame">
        <iframe
          src="https://www.youtube.com/embed/fdduYVInSA8"
          allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture"
        ></iframe>
      </div>
      <figcaption>
        <a
          href="https://www.jfd.or.jp/2014/03/11/pid11787"
          target="_blank"
          rel="noopener"
        >全日本ろうあ連盟 » 東日本大震災から3年を迎えて 3.11声明</a>
      </figcaption>
    </figure>
    <h4>東京オリンピックと東京パラリンピック</h4>
    <p>2020年には東京でオリンピックが56年ぶりに開催されます。大会の基本コンセプトの一つに「多様性と調和」を挙げています。</p>
    <p>公式サイトではWebアクセシビリティの遵守はもちろんのこと、すべての人々にとってアクセシブルでインクルーシブな大会とするためのアクセシビリティ・ガイドラインも制定しています。</p>
    <p>パラリンピックでの選手の活躍を見る以外にも、国際的な大会で日本がどういうアクセシビリティな取り組みをしているのかを見てみるのもよいかもしれません。</p>
  </section>
</template>

<style scoped>
.youtube-frame {
  padding-top: 50.726%;
  position: relative;
}
.youtube-frame iframe {
  border: 0;
  width: 100%;
  height: 100%;
  position: absolute;
  top: 0;
  left: 0;
}
</style>
