{
  "name": "Name - Okuto Oyama",
  "nickname": "Nickname - Oyama Michinoku, yamanoku",
  "job": {
    "1": "FrontEnd Designer",
    "2": "Accessibility Advocator",
    "3": "UI Designer",
    "4": "Writer",
    "5": "Document Translater",
    "6": "Internet Watcher"
  },
  "info": {
    "caption": "I'm active on the Internet under the name of Oyama-Michinoku, yamanoku. My birthday is October 30, 1989. I was born in Noshiro City, Akita Prefecture. I'm male. Currently, I lives in Nagareyama City, Chiba Prefecture. One daughter's father and three cat owners.",
    "birth": "Born in Noshiro, Akita, Japan",
    "sex": "Sex - Man",
    "2008": {
      "before": "Get into Iwate University of Art and Culture Course.",
      "now": "Now - Art and Culture Course in Faculty of Humanities and Sociology"
    },
    "2014": "Get married.",
    "2016": "Daughter is born",
    "bfa": "Bachelor of Art and Culture Course.（BFA）",
    "bfa01": "Fine Arts",
    "bfa02": "Engineering and Design",
    "live": "Live in Nagareyama, Chiba, Japan",
    "photo": {
      "alt": "Photo Okuto Oyama",
      "caption": "Author's near shadow"
    }
  },
  "career": {
    "skillSet": "Set of Skills",
    "wantedly": "Wantedly",
    "lapras": "LAPRAS",
    "curriculumVitae": "Curriculum Vitae",
    "desc01": "I started my career as a Web designer, not as an engineer.",
    "desc02": "I changed my job as an engineer to concentrate on programming because I thought that I could not understand the basics of what I could and could not do on the browser and could not make expressions and feature proposals that would be pleasing to users, rather than the influence of my previous career when I was in charge of all direction-design programming.",
    "desc03": "I began my career as a markup engineer, taking basic coding and gradually moving into the frontend engineer space, including jQuery, Ajax communication, task runners, CSS design, and the use of frameworks.",
    "desc04": "When I aim to become an engineer, there are some things that I want to achieve that I create “A product that has been used for a long time with a strong design”. We believe that we can achieve this not only through engineering, but also through UI design, user experience, and consideration for wider use. It's a difficult task, but I want to do it one by one so that everyone can enjoy better things."
  },
  "product": {
    "wafb": {
      "title": "Web Accessibility for Beginners.",
      "circleDetail": "Circle details | Scarlet dog",
      "boothLink": "Sales page on Booth",
      "noteLink": "Sales page on note"
    },
    "slackprimoji": "slack-reaction-primoji",
    "yamanokuCli": "yamanoku CLI",
    "reading": "Reading...",
    "vuePortfolio": "Vue Portfolio Template",
    "vueA11yPage": {
      "title": "About accessibility with Vue.js",
      "link": "Article about accessibility with Vue.js",
      "info": {
        "listitem01": "Published.",
        "listitem02" : "Posted on {awesomeA11yVue}",
        "listitem03" : "Added english page"
      }
    },
    "crowding": "Crowding - Coding works",
    "birthdayCount": "Birthday Countdown",
    "glitch": "glitchrange",
    "browserCrash": "canvas_browser-crash.js",
    "sushi": "rolling-sushi",
    "qiitaCode": "Qiita Code Style Before",
    "designFigma": "Product Design - Figma",
    "updateInfo": "Update Information",
    "releaseInfo": "Release Information",
    "description": {
      "wafb": "Presented in the 5th technical book fest. I would like to ask not only engineers but also all people involved with the web to see what kind of measures are available for web accessibility, such as machine-readable web pages, human-readable web pages, and WAI-ARIA web pages.",
      "reading": "I came up with the idea of accumulating and visualizing information about what would happen if I collected and summarized the news that I always watch. It incorporates PWA technology so that it can also be viewed as an offline application.",
      "vuePortfolio": "Portfolio template made by Vue.js. This is the first SPA created from vue cli. I used the Vue 1.0 versions at first, but now I can upgrade it to the Vue 2.0 versions.",
      "vueA11yPage": "Created with the motivation to make people aware of accessibility in Vue.js development. Initially, it was put together as a presentation for a conference and later as an advent calendar article, but we are updating it on time to make it a more practical reference and functional document.",
      "yamanokuCli": "This is a simple self-introduction tool that can be checked with the CLI. Fork is from sindresorhus.",
      "slackprimoji": "Convert Pri-para character lines into Slack reaction emoji. The original story is from slack-reaction-decomoji produced by oti.",
      "qiitaCode": "A Chrome extension that restores Qiita's code style to the previous one. Not published to the store. Therefore, add it in developer mode.",
      "birthdayCount": "Counting down to yamanoku's birthday. Amazon's wish list will be released on that day. The next day, it will be reset and counted down again. This product uses TypeScript.",
      "glitch": "A glitch expression tool using JavaScript. To adjust <input type='range'>. You can upload and change the image. Glitched images can also be saved.",
      "browserCrash": "Represents on canvas the situation that is likely to happen when the browser becomes heavy on Windows OS. The browser is drawn indefinitely by moving the cursor. There is no illegality in this JavaScript.",
      "sushi": "Rotating sushi using CSS3 animation."
    }
  },
  "sns": {
    "tumblr": {
      "tumblr": "Tumblr",
      "tumblog": "Blog",
      "artworks": "art works"
    },
    "twitter": "Twitter",
    "facebook": "Facebook",
    "github": "Github",
    "qiita": "Qiita",
    "mstdn": "mstdn.jp",
    "instagram": "Instagram",
    "hatena": "Hatena",
    "steam": "Steam"
  },
  "home": {
    "title": "Home"
  },
  "aboutPage": {
    "title": "About yamanoku.net",
    "description": "yamanoku.net is a portal site of Okuto Oyama called yamanoku.",
    "heading": {
      "toc": "Table of Contents",
      "implementation": "Explaining site implementation",
      "design": "Explaining site design"
    },
    "subHeading": {
      "markup": "Markup",
      "components": "Component oriented design",
      "pwa": "PWA (Progressive Web Application)",
      "i18n": "Internationalization",
      "overdesign": "Don't overdesign.",
      "fontSize": "Font size",
      "contrast": "Color contrast",
      "maxWidth": "About the greatest amount of content",
      "verticalRhythm": "Vertical rhythm"
    },
    "markup": {
      "desc01": "Semantic markup implementation to realize information design of human-readable (Human can understand) and machine-readable (Be understood by the machine).",
      "desc02": "It also implements content completion using WAI-ARIA (Web Accessibility Initiative - Accessible Rich Internet Applications).",
      "caption": "Assist users as they move from article to article by tying aria-labelledby to article elements."
    },
    "components": {
      "desc01": "You need to format the API you get for display, but managing it as a single component simplifies source code, allows multiple uses, and simplifies information design.",
      "desc02": "For example, the slide list uses the following components to render:",
      "desc03": "In addition, we set the Store to call each API to prevent the depth of Props in component-oriented development."
    },
    "pwa": {
      "desc01": "When browsing in Google Chrome, you can use desktop PWA from your PC or PWA from your mobile device.",
      "desc02": "You can launch it as a native app without going through a browser, use the cache to get a fast page experience, or download it once and view it offline."
    },
    "i18n": {
      "desc01": "Since we are developing on Nuxt.js, we have introduced a tool called nuxt-18n. In addition to internationalization, rendering can also be done for specific languages.",
      "desc02": "The following is a conditional expression that is displayed when it is not in Japanese."
    },
    "designDescription": "Inclusive design designed for easy viewing by all users.",
    "overdesign": {
      "desc01": "Too much decoration can prevent you from getting the information you want. It is designed with the default style of the browser, that is, the standard image in mind.",
      "desc02": "It's also the semantic markup of the design makes it possible to arrive at the information without feeling out of place, even with the default style in browser."
    },
    "fontSize": {
      "desc01": "The basic setting is 16 px, and the size ratio can be maintained even if the page is enlarged by rem."
    },
    "contrast": {
      "desc01": "All colors are set to have a contrast ratio of at least 4.5:1 with the background, but they are not pure black and white, but instead are balanced with fewer shades of gray.",
      "desc02": "It is specified using the following custom properties (CSS Variables) for common use:",
      "desc03": "It also supports dark mode (Gentle dark tones of the eyes), depending on the OS settings."
    },
    "maxWidth": {
      "desc01": "The maximum width of the main content is set to 80ch. ch is called a chain and is a variable unit depending on the size of the character.",
      "desc02": "The advantage of this setting is that it can support users with dyslexia who cannot read long sentences, and it is less likely that some text will become unreadable as the character size increases."
    },
    "verticalRhythm": {
      "desc01": "We use vertical rhythm that emphasizes consistency throughout the page. The margins and margins are set relative to the line spacing of 24px.",
      "desc02": "Cognitively impaired users can read text more easily if the words are evenly spaced."
    }
  },
  "vueA11yPage": {
    "title": "About accessibility with Vue.js",
    "description": "This post is from day 21 of the Web Accessibility Advent Calendar 2019. This article is about web accessibility support in Vue.js development.",
    "subHeading": {
      "info": "Information about this document"
    },
    "feedback": {
      "github": {
        "linkTitle": "Request for correction of the article “About accessibility with Vue.js”"
      }
    }
  },
  "archivePage": {
    "title": "Archive",
    "desc01": "This page is a collection of past articles and logs of Okuto Oyama called yamanoku.",
    "desc02": "We fixed the broken links during the document migration, but the content itself has not been updated, so please be careful when you refer to it.",
    "desc03": "We don't accept any corrections regarding the contents, but please contact us if you find any text errors or omissions.",
    "backText": "Back to Archive List",
    "feedback": {
      "github": {
        "linkTitle": "Request for correction of archive document"
      }
    }
  },
  "privacyPage": {
    "title": "Privacy Policy",
    "description": "yamanoku.net privacy policy page. Provides information about access analysis tools.",
    "analytics": {
      "heading": "About Access Analysis Tools",
      "desc01": "yamanoku.net uses Google's access analysis tool “Google Analytics”.",
      "desc02": "This Google Analytics server uses cookies to collect access information. This access information is collected anonymously and is not personally identifiable.",
      "desc03": "Google Analytics cookies on this site will be retained for 26 months. This feature can be rejected by disabling cookies, so please check your browser settings.",
      "link01": {
        "title": "Google Analytics Terms of Service",
        "url": "https://www.google.com/analytics/terms/us.html"
      },
      "link02": {
        "title": "How Google uses information from sites or apps that use our services",
        "url": "https://policies.google.com/technologies/partner-sites?hl=en"
      }
    }
  },
  "heading": {
    "basic": "Basic Info",
    "job": "Job Info",
    "career": "Career Info",
    "productList": "Product List",
    "todoList": "TODO List",
    "techStack": "Technology Stack",
    "relatedList": "Related Links List",
    "slides": {
      "title": "Slides",
      "stage": "Stage",
      "study": "Study Meeting",
      "write": "Writing",
      "lt": "Lightning Talk"
    },
    "sns": "Social Service",
    "contact": "Contact"
  },
  "error": {
    "404": {
      "text01": "Couldn't find the page you were looking for.",
      "text02": "We apologize for the inconvenience, but please access the relevant page from the site map."
    },
    "500": {
      "text01": "A server error has occurred. Please wait for a while and try again.",
      "text02": "If it is still not recovered, please contact us via the email address."
    },
    "sitemap": {
      "title": "Find on site map"
    }
  },
  "prefixAlt": {
    "photo": "Photo: ",
    "thumbnail": "Thumbnail: ",
    "screenshot": "ScreenShot: "
  },
  "multilingual": "Multilingual Page",
  "details": {
    "summary": "Details",
    "summary_feedback": "Correction requests for articles"
  },
  "feedback": {
    "github": {
      "link": "Issue details: ",
      "title": "Creating a GitHub Issue"
    },
    "twitter": {
      "title": "Tweet for author"
    }
  },
  "backTop": "Return to the top page",
  "onlyJPText": "Sorry, Japanese text only"
}
